# Equality Operator

---
C#Visual BasicVisual C++
Revit 2024 API
---
SchedulableField..::..Equality Operator
SchedulableField Class See Also
---
Determines whether two SchedulableField are the same.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool operator ==(
	SchedulableField first,
	SchedulableField second
)
```

Visual Basic
---
```text
Public Shared Operator = ( _
	first As SchedulableField, _
	second As SchedulableField _
) As Boolean
```

Visual C++
---
```text
public:
static bool operator ==(
	SchedulableField^ first,
	SchedulableField^ second
)
```

# ### Parameters
first
    Type: Autodesk.Revit.DB..::..SchedulableFieldThe first SchedulableField.
second
    Type: Autodesk.Revit.DB..::..SchedulableFieldThe second SchedulableField.
# ### Return Value
True if the SchedulableField are the same, otherwise false.
# See Also
SchedulableField Class
Autodesk.Revit.DB Namespace